Revit 2024 API
RoutingPreferenceRule.NumberOfCriteria Property
 Gets the number of routing criteria.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int NumberOfCriteria { get; }
Visual Basic
Public ReadOnly Property NumberOfCriteria As Integer
	Get
Visual C++
public:
property int NumberOfCriteria {
	int get ();
}
See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace